RT-Thread/rt-thread/bsp/freescale/platform/devices/MKV31F25612/include/MKV31F25612.h
/*
** End of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #pragma pop
#elif defined(__CWCC__)
  #pragma pop
#elif defined(__GNUC__)
  /* leave anonymous unions enabled */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=default
#else
  #error Not supported compiler type
#endif

/*!
 * @}
 */ /* end of group Peripheral_access_layer */


/* ----------------------------------------------------------------------------
   -- Backward Compatibility
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Backward_Compatibility_Symbols Backward Compatibility
 * @{
 */

#define  MCG_C2_EREFS0_MASK          MCG_C2_EREFS_MASK
#define  MCG_C2_EREFS0_SHIFT         MCG_C2_EREFS_SHIFT
#define  MCG_C2_HGO0_MASK            MCG_C2_HGO_MASK
#define  MCG_C2_HGO0_SHIFT           MCG_C2_HGO_SHIFT
#define  MCG_C2_RANGE0_MASK          MCG_C2_RANGE_MASK
#define  MCG_C2_RANGE0_SHIFT         MCG_C2_RANGE_SHIFT
#define  MCG_C2_RANGE0(x)            MCG_C2_RANGE(x)
#define ADC_BASES                    ADC_BASE_PTRS
#define CMP_BASES                    CMP_BASE_PTRS
#define CRC_BASES                    CRC_BASE_PTRS
#define DAC_BASES                    DAC_BASE_PTRS
#define DMA_BASES                    DMA_BASE_PTRS
#define DMAMUX_BASES                 DMAMUX_BASE_PTRS
#define EWM_BASES                    EWM_BASE_PTRS
#define FMC_BASES                    FMC_BASE_PTRS
#define FTFA_BASES                   FTFA_BASE_PTRS
#define FTM_BASES                    FTM_BASE_PTRS
#define GPIO_BASES                   GPIO_BASE_PTRS
#define I2C_BASES                    I2C_BASE_PTRS
#define LLWU_BASES                   LLWU_BASE_PTRS
#define LPTMR_BASES                  LPTMR_BASE_PTRS
#define LPUART_BASES                 LPUART_BASE_PTRS
#define MCG_BASES                    MCG_BASE_PTRS
#define MCM_BASES                    MCM_BASE_PTRS
#define NV_BASES                     NV_BASE_PTRS
#define OSC_BASES                    OSC_BASE_PTRS
#define PDB_BASES                    PDB_BASE_PTRS
#define PIT_BASES                    PIT_BASE_PTRS
#define PMC_BASES                    PMC_BASE_PTRS
#define PORT_BASES                   PORT_BASE_PTRS
#define RCM_BASES                    RCM_BASE_PTRS
#define RFSYS_BASES                  RFSYS_BASE_PTRS
#define RFVBAT_BASES                 RFVBAT_BASE_PTRS
#define RNG_BASES                    RNG_BASE_PTRS
#define RTC_BASES                    RTC_BASE_PTRS
#define SIM_BASES                    SIM_BASE_PTRS
#define SMC_BASES                    SMC_BASE_PTRS
#define SPI_BASES                    SPI_BASE_PTRS
#define UART_BASES                   UART_BASE_PTRS
#define VREF_BASES                   VREF_BASE_PTRS
#define WDOG_BASES                   WDOG_BASE_PTRS
#define Watchdog_IRQn                WDOG_EWM_IRQn
#define Watchdog_IRQHandler          WDOG_EWM_IRQHandler
#define LPTimer_IRQn                 LPTMR0_IRQn
#define LPTimer_IRQHandler           LPTMR0_IRQHandler
#define LLW_IRQn                     LLWU_IRQn
#define LLW_IRQHandler               LLWU_IRQHandler

/*!
 * @}
 */ /* end of group Backward_Compatibility_Symbols */


#else /* #if !defined(MKV31F25612_H_) */
  /* There is already included the same memory map. Check if it is compatible (has the same major version) */
  #if (MCU_MEM_MAP_VERSION != 0x0100u)
    #if (!defined(MCU_MEM_MAP_SUPPRESS_VERSION_WARNING))
      #warning There are included two not compatible versions of memory maps. Please check possible differences.
    #endif /* (!defined(MCU_MEM_MAP_SUPPRESS_VERSION_WARNING)) */
  #endif /* (MCU_MEM_MAP_VERSION != 0x0100u) */
#endif  /* #if !defined(MKV31F25612_H_) */

/* MKV31F25612.h, eof. */
